---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RampAttrShape
source: html/8dccf16d-b2ad-7e6f-9e86-827e2e1b1465.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RampAttrShape Property

"Shape"

## Syntax (C#)
```csharp
public static ForgeTypeId RampAttrShape { get; }
```